/**
 * Базовый класс для справочников
 */
Ext.define('Earh.store.Dict', {
	extend: 'Ext.data.Store',
	model: 'Earh.model.Dict',
	requires: 'Ext.data.proxy.Ajax',
	constructor: function (dict) {
		this.callParent();
		this.setProxy(Ext.create('Ext.data.proxy.Ajax', {
			url: Urls.dict,
			reader: 'json',
			writer: 'json',
			extraParams: {dict: dict}
		}));
//		if (dict === Dicts.casetype)
//			this.loadData([
//				{id: 1, value: "решения и заключения ВККС", code: ''},
//				{id: 2, value: "отчетные доклады ВККС", code: ''},
//				{id: 3, value: "разъяснения и рекомендации ВККС", code: ''},
//				{id: 4, value: "материалы по организации, подготовке и проведению", code: ''},
//				{id: 5, value: "заседаний и иных мероприятий ВККС", code: ''},
//				{id: 6, value: "материалы по переписке ВККС с органами", code: ''},
//				{id: 7, value: "государственной власти, органами судейского", code: ''},
//				{id: 8, value: "сообщества и общественными организациями", code: ''},
//				{id: 9, value: "материалы проверок", code: ''},
//				{id: 10, value: "материалы по заявлениям", code: ''},
//				{id: 11, value: "материалы о привлечении к дисциплинарной", code: ''},
//				{id: 12, value: "ответственности", code: ''},
//				{id: 13, value: "материалы по привлечению судей к уголовной", code: ''},
//				{id: 14, value: "ответственности", code: ''},
//				{id: 15, value: "статистические отчеты", code: ''},
//				{id: 16, value: "иные материалы.", code: ''},
//				{id: 17, value: "официальное издание Вестник ВККС", code: ''},
//				{id: 18, value: "ответы ВККС РФ на обращения (жалобы) физических и", code: ''},
//				{id: 19, value: "юридических лиц, передаваемых в отдел прохождения", code: ''},
//				{id: 20, value: "документов Управления делами", code: ''}
//			]);
//		else if (dict === Dicts.doctype)
//			this.loadData([
//				{id: 1, value: "Поручение", code: ''},
//				{id: 2, value: "Обращение", code: ''},
//				{id: 3, value: "Опись", code: ''},
//				{id: 4, value: "CD диск", code: ''},
//				{id: 5, value: "Копия обращения", code: ''},
//				{id: 6, value: "Копия сопроводительного письма", code: ''},
//				{id: 7, value: "Ответ Председателя Совета судей РФ", code: ''},
//				{id: 8, value: "Копия сопроводительного письма Председателю Следственного комитета РФ", code: ''},
//				{id: 9, value: "Ответ Следственного комитета РФ", code: ''},
//				{id: 10, value: "Конверт", code: ''},
//				{id: 11, value: "Докладная записка Председателю ВККС РФ", code: ''},
//				{id: 12, value: "Ответ ВККС РФ", code: ''},
//				{id: 13, value: "Объявление", code: ''},
//				{id: 14, value: "Заявление", code: ''},
//				{id: 15, value: "Справка", code: ''},
//				{id: 16, value: "Характеристика", code: ''},
//				{id: 17, value: "Основные показатели", code: ''},
//				{id: 18, value: "Уведомления", code: ''},
//				{id: 19, value: "Копия анкеты", code: ''},
//				{id: 20, value: "Запрос", code: ''},
//				{id: 21, value: "Заявление об ознакомлении с материалами", code: ''},
//				{id: 22, value: "Жалоба с приложением", code: ''},
//				{id: 23, value: "Конверт (приложение к жалобе)", code: ''},
//				{id: 24, value: "Ходатайство о приобщении документов к материалам дела с приложением", code: ''},
//				{id: 25, value: "Файл с фотографиями (приложение к ходатайству)", code: ''},
//				{id: 26, value: "Протокол", code: ''},
//				{id: 27, value: "Решение", code: ''},
//				{id: 28, value: "Заявление о выдаче протокола", code: ''},
//				{id: 29, value: "Сопроводительное письмо", code: ''}
//			]);
//		else if (dict === Dicts.storelife)
//			this.loadData([
//				{id: 1, value: "дело постоянного хранения", code: ''},
//				{id: 2, value: "дело временного хранения (> 10 лет)", code: ''},
//				{id: 3, value: "дело временного хранения (< 10 лет)", code: ''},
//				{id: 4, value: "дело по личному составу", code: ''},
//				{id: 5, value: "5 лет", code: ''}]);
	}
});



